import streamlit as st

st.markdown(
    """
    <style>
    body {
        text-align: right;
    }
    </style>
    """,
    unsafe_allow_html=True
)

st.title("اليوم الوطني السعودي")

st.write(
    "##### تحتفل المملكة العربية السعودية باليوم الوطني لتوحيد المملكة في 23 سبتمبر من كل عام. وهذا التاريخ يعود إلى "
    "المرسوم الملكي الذي أصدره الملك المؤسس عبد العزيز برقم 2716، وتاريخ 17 جمادى الأولى عام 1351هـ، الذي قضى "
    "بتحويل اسم الدولة من مملكة الحجاز ونجد وملحقاتها إلى المملكة العربية السعودية، وذلك ابتداءً من يوم"
    " الخميس 21 جمادى الأولى 1351 هـ الموافق فيه للأول من الميزان، والموافق يوم 23 سبتمبر من عام 1932م.")

st.write("")
st.write("")

st.subheader("توحيد المملكة العربية السعودية")

st.write("##### في 5 شوال 1319هـ الموافق 15 يناير 1902م تمكن الملك عبد العزيز بن عبد الرحمن بن فيصل آل سعود مؤسس "
         "المملكة العربية السعودية"
         " من استعادة الرياض عاصمة أسلافه مؤسسي الدولة السعودية الثانية، والعودة بأسرته إليها. بعد استرداد الرياض "
         "الملك عبد العزيز كفاح مسلح لمدة زادت عن 30 عام من أجل توحيد مملكته، وتمكن من توحيد العديد من المناطق من "
         "أهمها: جنوب نجد وسدير والوشم سنة 1320هـ / 1902م، من ثم القصيم سنة 1322هـ/1904م، ثم الأحساء سنة 1331هـ/ "
         "1913م، وصولاً إلى عسير سنة 1338هـ / 1919م، وحائل سنة 1340هـ/ 1921م. إلى أن تمكّن الملك المؤسس عبد العزيز من"
         "ضم منطقة الحجاز بين عامي 1343 هـ و1344 هـ الموافقة لسنة 1925م، وفي عام 1349 هـ / 1930م أكتمل توحيد منطقة "
         "جازان."
         "\ وفي السابع عشر من شهر جمادى الأولى عام 1351 هـ الموافق التاسع عشر من شهر سبتمبر عام 1932م صدر أمر ملكي "
         "للإعلان عن توحيد البلاد وتسميتها باسم المملكة العربية السعودية اعتباراً من الخميس 21 جمادى الأولى عام 1351 "
         "ه، الموافق 23 سبتمبر 1932م (الأول من الميزان)")

st.write("")
st.write("")

st.subheader("احداث ومناسبات في نفس اليوم")

st.write(
    "#####	2005 : أقر الملك عبد الله أنه ابتداءً من اليوم الوطني السعودي 75 يصبح اليوم الوطني إجازة رسمية للدولة. ")
st.write("##### 2009: شهد اليوم الوطني السعودي 79 قيام الملك عبد الله بن عبد العزيز آل سعود بافتتاح جامعة الملك عبد "
         "الله للعلوم والتقنية، وذلك بحضور عدد من رؤساء دول العالم.")
st.write("##### 2014: في اليوم الوطني السعودي 84 دشنت أمانة محافظة جدة أطول سارية علم في العالم، وهي من مبادرات عبد "
         "اللطيف جميل الاجتماعية، تتوسط السارية ميدان خادم الحرمين الشريفين وسط جدة، بارتفاع يتجاوز 171 متراً، وبمقاس "
         "علم يبلغ 49.5 متر طولاً، و33 متر عرضاً، بمساحة إجمالية تبلغ 1635 متراً مربعاً، وبوزن 570 كلغم، وعلى مساحة "
         "تتجاوز 26 ألف متر مربع.")
st.write("##### 2015: وافق اليوم الوطني السعودي 85 يوم الأربعاء 9 ذي الحجة (يوم عرفة)، وكان ذلك لأول مرة")
